package com.spacedo.algorithms.sort;

public class SortPerformanceTest {
    // 测试逻辑在ShellSort中

    // 希尔排序
    // N/2:100_0000:100:208
    // N/2:104_8576:100:1298
    // N/2:1000_0000:10:3339
    // 2^k-1:100_0000:100:274
    // 2^k-1:104_8576:100:290
    // 2^k-1:1000_0000:10:4633
    // hi=max(9∗4j−9∗2j+1,4k−3∗2k+1):100_0000:100:175
    // hi=max(9∗4j−9∗2j+1,4k−3∗2k+1):104_8576:100:185
    // hi=max(9∗4j−9∗2j+1,4k−3∗2k+1):1000_0000:10:2407
    // 2^k/k 奇数：1000_0000:2649
    // 小于2^k的最大质数：1000_0000:10:2853

    // 快速排序
    // 随机快排:100_0000:10:100
    // 随机快排:1000_0000:10:1100
    // QuickSort2Ways:100_0000:10:102
    // QuickSort2Ways:1000_0000:10:1155
    // QuickSort3Ways:100_0000:10:128
    // QuickSort3Ways:1000_0000:10:1434

    // jdk Arrays
    // Arrays.sort():100_0000:10:77
    // Arrays.sort():1000_0000:10:802
}
